// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if(friends.length >= 3){
    console.log('це великий масив, в якому  3 і більше елементи')
} else {
    console.log('це маленький масив, в якому менше 3-х елементів')
}



//
//
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = 3
let b = 0
let c = -1

if(a > b && a < c || a > c && a < b ){
    console.log(`по середине идет переменная a = ${a}`)
} else if(b > a && b < c || b < a && b > c) {
    console.log(`по середине идет переменная b = ${b}`)
} else if(c > a && c < b || c < a && c > b){
    console.log(`по середине идет переменная c = ${c}`)
} else if (a === b || a === c || b === c){
    console.log('числа одинаковые')
} else {
    console.log('Error')
}



//
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

let result;

a + b < 4 ? result = 'Мало':  result = 'Багато'
console.log(result)
//
//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
//
//
let num = 43

let result1 = num < 0
    ? 'число отрицательное'
    : num === 0
        ? 'число равно 0'
        : num > 0
            ? 'число положительное'
            : 'Error';

console.log(result1);

//
//
//
//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//

let test = false
if(test){
    console.log('Вірно')
} else {
    console.log('Неправильно')
}



let result2 = test ? 'Вірно'
    : 'Неправильно'
console.log(result2)

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо коростова вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//
//
// let userResponse = prompt('Яка «офіційна» назва JavaScript?')
//
// if (userResponse === 'ECMAScript'){
//     console.log('Правильно!')
// } else {
//     console.log('Не знаєте? ECMAScript!')
// }

//
//
//
//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//

let number4 = 49

if (number4 >= 1 && number4 <= 20){
    console.log('перший подьезд')
} else if(number4 >= 21 && number4 <= 48){
    console.log('второй подьезд')
} else if(number4 >= 49 && number4 <= 90){
    console.log('третий подьезд')
}



//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number5 = 4

if (number5 === 10){
    console.log('ВІРНО')
} else {
    console.log('НЕВІРНО')
}


//
//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
//
let temperature = 20

if (temperature >= 10 && temperature <= 22){
    console.log('йдемо ВЧИТИСЯ')
} else {
    console.log('сидимо вдома і вчимося ОНЛАЙН')
}





// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ..

let victorinaNumber = 3
switch (victorinaNumber){
    case 1:
        console.log('Авто')
        break
    case 2:
        console.log('Мото')
        break
    case 3:
        console.log('Телефон')
        break
    case 4:
        console.log('aboba')
        break
    case 5:
        console.log('kek')
        break
    default:
        console.log('число не вірне ')
}







